In [2]:
#importing the pandas library:
import pandas as pd
import numpy as np

In [3]:
array= np.array([1,2,3,4,6,7,8])

In [10]:
S= pd.Series(array, index=['a','b','c','d','e','f','g'])
S

a    1
b    2
c    3
d    4
e    6
f    7
g    8
dtype: int32

In [12]:
first_series= pd.Series(list('abcdef'))
first_series

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [13]:
np_country= np.array(['India','pak','china','Srilanka','afghanistan','russia','australia'])

In [14]:
country_series= pd.Series(np_country)

In [15]:
country_series

0          India
1            pak
2          china
3       Srilanka
4    afghanistan
5         russia
6      australia
dtype: object

In [19]:
dict_gdp={'gdp':[1008.90,56890.90,3456.899,344568,788656.98,4566,8986.876],'name':['India','pak','china','Srilanka','afghanistan','russia','australia']}

In [20]:
dict_gdp

{'gdp': [1008.9, 56890.9, 3456.899, 344568, 788656.98, 4566, 8986.876],
 'name': ['India',
  'pak',
  'china',
  'Srilanka',
  'afghanistan',
  'russia',
  'australia']}

In [21]:
dict_gdp_series= pd.Series(dict_gdp)

In [22]:
dict_gdp_series

gdp     [1008.9, 56890.9, 3456.899, 344568, 788656.98,...
name    [India, pak, china, Srilanka, afghanistan, rus...
dtype: object

In [23]:
gdp_series= pd.Series([1008.90,56890.90,3456.899,344568,788656.98,4566,8986.876], index=['India','pak','china','Srilanka','afghanistan','russia','australia'])

In [24]:
gdp_series

India            1008.900
pak             56890.900
china            3456.899
Srilanka       344568.000
afghanistan    788656.980
russia           4566.000
australia        8986.876
dtype: float64

In [25]:
scalar_series= pd.Series(5, index=['a','b','c','d'])

In [26]:
scalar_series

a    5
b    5
c    5
d    5
dtype: int64

In [27]:
gdp_series

India            1008.900
pak             56890.900
china            3456.899
Srilanka       344568.000
afghanistan    788656.980
russia           4566.000
australia        8986.876
dtype: float64

In [36]:
#To access the first element in gdp_series:
gdp_series[0:1]

India    1008.9
dtype: float64

In [35]:
#To access the first 5 countries:
gdp_series[0:5]

India            1008.900
pak             56890.900
china            3456.899
Srilanka       344568.000
afghanistan    788656.980
dtype: float64

In [38]:
#Look up a country by its name: ##use loc function:
gdp_series.loc['russia']

4566.0

In [42]:
#Look up gdp of a particular country:
gdp_series.loc['pak']

56890.9

In [43]:
#Look up by position:
gdp_series.iloc[4]

788656.98

In [49]:
gdp_series[4:5]

afghanistan    788656.98
dtype: float64

In [57]:
#Vectorized operations are performed by data elements position:
first_vector= pd.Series([1,2,3,4,5], index= ['a','b','c','d','e'])
second_vector= pd.Series([10,20,30,40,50], index= ['a','b','c','d','e'])
third_vector= pd.Series([12,23,34,5,67], index= ['a','b','c','g','h'])

In [53]:
first_vector+second_vector

a    11
b    22
c    33
d    44
e    55
dtype: int64

In [58]:
first_vector+third_vector

a    13.0
b    25.0
c    37.0
d     NaN
e     NaN
g     NaN
h     NaN
dtype: float64

In [59]:
import pandas as pd

In [64]:
#Last 5 year olympic data:
olympic_data= {'Host_City':['London','Bejing','Athens','Sydney','Atlanta'], 'Year':[2012,2008,2004,2000,1996], "No_of_participating_countries":[205,204,201,200,197]}

In [67]:
olympic_data

{'Host_City': ['London', 'Bejing', 'Athens', 'Sydney', 'Atlanta'],
 'Year': [2012, 2008, 2004, 2000, 1996],
 'No_of_participating_countries': [205, 204, 201, 200, 197]}

In [69]:
#data frame:
olympic_data_df=pd.DataFrame(olympic_data)
olympic_data_df

  Host_City  Year  No_of_participating_countries
0    London  2012                            205
1    Bejing  2008                            204
2    Athens  2004                            201
3    Sydney  2000                            200
4   Atlanta  1996                            197

# Creating a dataframe and a series from a dictionary:
olympic_data_dict= {'London':{2012:205},"Bejing":{2008:204},"Athens":{2004:201},'Sydney':{2000,200},'Atlanta':{1996:197}}
olympic_data_dict
olympic_data_Series= pd.Series(olympic_data_dict)
olympic_data_Series

In [83]:
olympic_data_dict= {'London':{2012:205},"Bejing":{2008:204},"Athens":{2004:201},'Sydney':{2000,200},'Atlanta':{1996:197}}
olympic_data_Series= pd.Series(olympic_data_dict)
olympic_data_Series

London     {2012: 205}
Bejing     {2008: 204}
Athens     {2004: 201}
Sydney     {2000, 200}
Atlanta    {1996: 197}
dtype: object

In [91]:
olympic_data_dict= {'London':{2012:205},"Bejing":{2008:204}}
olympic_data_dict_df= pd.DataFrame(olympic_data_dict)
olympic_data_dict_df

      London  Bejing
2012   205.0     NaN
2008     NaN   204.0

In [99]:
#Selecting a city name:
olympic_data_df.Host_City

0     London
1     Bejing
2     Athens
3     Sydney
4    Atlanta
Name: Host_City, dtype: object

In [100]:
#Slicing:
olympic_data_df.Host_City[2:5]

2     Athens
3     Sydney
4    Atlanta
Name: Host_City, dtype: object

In [104]:
#using DESCRIBE to display all the content:
olympic_data_df.describe

<bound method NDFrame.describe of   Host_City  Year  No_of_participating_countries
0    London  2012                            205
1    Bejing  2008                            204
2    Athens  2004                            201
3    Sydney  2000                            200
4   Atlanta  1996                            197>

In [103]:
olympic_data_df.info

<bound method DataFrame.info of   Host_City  Year  No_of_participating_countries
0    London  2012                            205
1    Bejing  2008                            204
2    Athens  2004                            201
3    Sydney  2000                            200
4   Atlanta  1996                            197>

In [123]:
#Creating a dataframe from dict of Series:
olym_count= pd.Series(['London','Bejing','Athens','Sydney','Atlanta'], index=[2012,2008,2004,2000,1996])
olym_count

2012     London
2008     Bejing
2004     Athens
2000     Sydney
1996    Atlanta
dtype: object

In [117]:
olym_no_of_part_count= pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])
olym_no_of_part_count

2012    205
2008    204
2004    201
2000    200
1996    197
dtype: int64

In [121]:
#Creating a dataframe from two series:
olym_df= pd.DataFrame({'Host_Countries':olym_count,'No_of_participating countries':olym_no_of_part_count})
olym_df

     Host_Countries  No_of_participating countries
2012         London                            205
2008         Bejing                            204
2004         Athens                            201
2000         Sydney                            200
1996        Atlanta                            197

# Creating data Frame from numpy array:

In [124]:
import numpy as np
import pandas as pd

In [125]:
np_array= np.array([2012,2007,2006,2018,2019])

In [129]:
np_array_df= pd.DataFrame({'Year':np_array})
np_array_df

   Year
0  2012
1  2007
2  2006
3  2018
4  2019

In [132]:
ser1= pd.Series([10,20,30,40], index=['a','b','c','d'])
ser1

a    10
b    20
c    30
d    40
dtype: int64

In [133]:
#For reindexing of the series:
ser1.reindex(['c','d','b','a'])

c    30
d    40
b    20
a    10
dtype: int64

In [135]:
ser2= pd.Series([1,2,3,None], index=['a','b','c','d'])
ser2

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

In [136]:
ser2.d

nan

In [152]:
#To know where the value is null
ser2.isnull()

a    False
b    False
c    False
d     True
dtype: bool

In [156]:
ser2.d

nan

In [158]:
np.where(ser2.isnull()== True)

(array([3], dtype=int64),)

In [159]:
ser2[3]

nan

In [252]:
df= pd.read_csv('C:\Python\Dataset\CARS.csv')

In [253]:
df

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [254]:
pd.read_csv?

In [255]:
#for first five rows
df.head()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197

In [256]:
#For last 5 rows
df.tail()

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [257]:
#To get specific number of rows from starting
df.head(10)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270,20,28,3575,108,186
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225,18,24,3880,115,197
5,Acura,3.5 RL w/Navigation 4dr,Sedan,Asia,Front,"$46,100","$41,100",3.5,6.0,225,18,24,3893,115,197
6,Acura,NSX coupe 2dr manual S,Sports,Asia,Rear,"$89,765","$79,978",3.2,6.0,290,17,24,3153,100,174
7,Audi,A4 1.8T 4dr,Sedan,Europe,Front,"$25,940","$23,508",1.8,4.0,170,22,31,3252,104,179
8,Audi,A41.8T convertible 2dr,Sedan,Europe,Front,"$35,940","$32,506",1.8,4.0,170,23,30,3638,105,180
9,Audi,A4 3.0 4dr,Sedan,Europe,Front,"$31,840","$28,846",3.0,6.0,220,20,28,3462,104,179

In [258]:
#To get specific number of rows from bottom:
df.tail(10)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
418,Volvo,S60 2.5 4dr,Sedan,Europe,All,"$31,745","$29,916",2.5,5.0,208,20,27,3903,107,180
419,Volvo,S60 T5 4dr,Sedan,Europe,Front,"$34,845","$32,902",2.3,5.0,247,20,28,3766,107,180
420,Volvo,S60 R 4dr,Sedan,Europe,All,"$37,560","$35,382",2.5,5.0,300,18,25,3571,107,181
421,Volvo,S80 2.9 4dr,Sedan,Europe,Front,"$37,730","$35,542",2.9,6.0,208,20,28,3576,110,190
422,Volvo,S80 2.5T 4dr,Sedan,Europe,All,"$37,885","$35,688",2.5,5.0,194,20,27,3691,110,190
423,Volvo,C70 LPT convertible 2dr,Sedan,Europe,Front,"$40,565","$38,203",2.4,5.0,197,21,28,3450,105,186
424,Volvo,C70 HPT convertible 2dr,Sedan,Europe,Front,"$42,565","$40,083",2.3,5.0,242,20,26,3450,105,186
425,Volvo,S80 T6 4dr,Sedan,Europe,Front,"$45,210","$42,573",2.9,6.0,268,19,26,3653,110,190
426,Volvo,V40,Wagon,Europe,Front,"$26,135","$24,641",1.9,4.0,170,22,29,2822,101,180
427,Volvo,XC70,Wagon,Europe,All,"$35,145","$33,112",2.5,5.0,208,20,27,3823,109,186

In [259]:
#To get the names of columns:
df.columns

Index(['name_of_car', 'Model', 'Type', 'Origin', 'DriveTrain', 'MSRP',
       'Invoice', 'EngineSize', 'Cylinders', 'Horsepower', 'MPG_City',
       'MPG_Highway', 'Weight', 'Wheelbase', 'Length'],
      dtype='object')

In [260]:
df.describe()

,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
count,428.000000,426.000000,428.000000,428.000000,428.000000,428.000000,428.000000,428.000000
mean,3.196729,5.807512,215.885514,20.060748,26.843458,3577.953271,108.154206,186.362150
std,1.108595,1.558443,71.836032,5.238218,5.741201,758.983215,8.311813,14.357991
min,1.300000,3.000000,73.000000,10.000000,12.000000,1850.000000,89.000000,143.000000
25%,2.375000,4.000000,165.000000,17.000000,24.000000,3104.000000,103.000000,178.000000
50%,3.000000,6.000000,210.000000,19.000000,26.000000,3474.500000,107.000000,187.000000
75%,3.900000,6.000000,255.000000,21.250000,29.000000,3977.750000,112.000000,194.000000
max,8.300000,12.000000,500.000000,60.000000,66.000000,7190.000000,144.000000,238.000000

In [261]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428 entries, 0 to 427
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name_of_car  428 non-null    object
 1   Model        428 non-null    object
 2   Type         428 non-null    object
 3   Origin       428 non-null    object
 4   DriveTrain   428 non-null    object
 5   MSRP         428 non-null    object
 6   Invoice      428 non-null    object
 7   EngineSize   428 non-null    float64
 8   Cylinders    426 non-null    float64
 9   Horsepower   428 non-null    int64
 10  MPG_City     428 non-null    int64
 11  MPG_Highway  428 non-null    int64
 12  Weight       428 non-null    int64
 13  Wheelbase    428 non-null    int64
 14  Length       428 non-null    int64
dtypes: float64(2), int64(6), object(7)
memory usage: 50.3+ KB

In [262]:
np.where(df.isnull()== True)

(array([247, 248], dtype=int64), array([8, 8], dtype=int64))

In [263]:
df.iloc[247:249]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
247,Mazda,RX-8 4dr automatic,Sports,Asia,Rear,"$25,700","$23,794",1.3,NaN,197,18,25,3053,106,174
248,Mazda,RX-8 4dr manual,Sports,Asia,Rear,"$27,200","$25,179",1.3,NaN,238,18,24,3029,106,174

In [264]:
df['Cylinders'].mean()

5.807511737089202

In [265]:
df.replace?

In [266]:
#df.Cylinders.replace()
df.iloc[247:249].replace(np.NaN,5.807512)

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
247,Mazda,RX-8 4dr automatic,Sports,Asia,Rear,"$25,700","$23,794",1.3,5.807512,197,18,25,3053,106,174
248,Mazda,RX-8 4dr manual,Sports,Asia,Rear,"$27,200","$25,179",1.3,5.807512,238,18,24,3029,106,174

In [270]:
df.shape

(428, 15)

In [271]:
df.index

RangeIndex(start=0, stop=428, step=1)

In [272]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428 entries, 0 to 427
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name_of_car  428 non-null    object
 1   Model        428 non-null    object
 2   Type         428 non-null    object
 3   Origin       428 non-null    object
 4   DriveTrain   428 non-null    object
 5   MSRP         428 non-null    object
 6   Invoice      428 non-null    object
 7   EngineSize   428 non-null    float64
 8   Cylinders    426 non-null    float64
 9   Horsepower   428 non-null    int64
 10  MPG_City     428 non-null    int64
 11  MPG_Highway  428 non-null    int64
 12  Weight       428 non-null    int64
 13  Wheelbase    428 non-null    int64
 14  Length       428 non-null    int64
dtypes: float64(2), int64(6), object(7)
memory usage: 50.3+ KB

In [273]:
df.Model

0                          MDX
1               RSX Type S 2dr
2                      TSX 4dr
3                       TL 4dr
4                   3.5 RL 4dr
                ...
423    C70 LPT convertible 2dr
424    C70 HPT convertible 2dr
425                 S80 T6 4dr
426                        V40
427                       XC70
Name: Model, Length: 428, dtype: object

In [274]:
df['Model']

0                          MDX
1               RSX Type S 2dr
2                      TSX 4dr
3                       TL 4dr
4                   3.5 RL 4dr
                ...
423    C70 LPT convertible 2dr
424    C70 HPT convertible 2dr
425                 S80 T6 4dr
426                        V40
427                       XC70
Name: Model, Length: 428, dtype: object

In [277]:
df.columns #Name of the columns

Index(['name_of_car', 'Model', 'Type', 'Origin', 'DriveTrain', 'MSRP',
       'Invoice', 'EngineSize', 'Cylinders', 'Horsepower', 'MPG_City',
       'MPG_Highway', 'Weight', 'Wheelbase', 'Length'],
      dtype='object')

In [278]:
df.DriveTrain

0        All
1      Front
2      Front
3      Front
4      Front
       ...
423    Front
424    Front
425    Front
426    Front
427      All
Name: DriveTrain, Length: 428, dtype: object

In [286]:
df[['Model','Type']]

                       Model   Type
0                        MDX    SUV
1             RSX Type S 2dr  Sedan
2                    TSX 4dr  Sedan
3                     TL 4dr  Sedan
4                 3.5 RL 4dr  Sedan
..                       ...    ...
423  C70 LPT convertible 2dr  Sedan
424  C70 HPT convertible 2dr  Sedan
425               S80 T6 4dr  Sedan
426                      V40  Wagon
427                     XC70  Wagon

[428 rows x 2 columns]

In [298]:
##Loc function is to extract the rows, and iloc function is to give the specific location of an element:
df.loc[0:2]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200,22,29,3230,105,183

In [299]:
df.iloc[0:2]

,name_of_car,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265,17,23,4451,106,189
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200,24,31,2778,101,172

In [300]:
df.iloc[0:2,0]

0    Acura
1    Acura
Name: name_of_car, dtype: object

In [303]:
##Converting dict into data frame:
dict1= {'name':['Aashti', 'hamid', 'Alisha','farid'], 'age':[32,65,5,36], 'marks':[23,24,25,26]}
df_dict1= pd.DataFrame(dict1)
df_dict1

     name  age  marks
0  Aashti   32     23
1   hamid   65     24
2  Alisha    5     25
3   farid   36     26

In [306]:
#Converting marks as index:
dict2= {'name':['Aashti', 'hamid', 'Alisha','farid'], 'age':[32,65,5,36]}
df_dict2= pd.DataFrame(dict2, index=[23,24,25,26])
df_dict2

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5
26   farid   36

In [309]:
df_dict2.loc[24]

name    hamid
age        65
Name: 24, dtype: object

In [313]:
df_dict2.loc[24,'age']

65

In [314]:
df_dict2.iloc[1,1]

65

In [316]:
#Slice of rows from row-1 to row-3 and all columns
df_dict2.loc[23:25]

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5

In [318]:
#Slice of the rows from row-1 to row-3 and only column 'name':
df_dict2.loc[23:25,'name']

23    Aashti
24     hamid
25    Alisha
Name: name, dtype: object

In [319]:
#Slice of the rows from row-2 to row-4 and only column 'age':
df_dict2.loc[24:26,'age']

24    65
25     5
26    36
Name: age, dtype: int64

In [320]:
#Slice of the rows till row-3 and only column 'age':
df_dict2.loc[:25,'age']

23    32
24    65
25     5
Name: age, dtype: int64

In [321]:
#Extracting the values by index location: iloc

In [322]:
#Extract rows from 1-3 and all columns by iloc and loc
df_dict2.iloc[0:3,]

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5

In [323]:
df_dict2.loc[23:25]

      name  age
23  Aashti   32
24   hamid   65
25  Alisha    5

In [324]:
#Extract all the rows from 2nd row and all columns:
df_dict2.iloc[1:,]

      name  age
24   hamid   65
25  Alisha    5
26   farid   36

In [330]:
#Extract row 2 and 4, first and last column
df_dict2.iloc[[1,3],[0,1]]

     name  age
24  hamid   65
26  farid   36

In [331]:
df_dict2.loc[[24,26],['name','age']]

     name  age
24  hamid   65
26  farid   36